src/cfe/Кодерлайн_интеграция_Розница/InformationRegisters/ксп_МэппингТипыСкладов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>ксп_МэппингТипыСкладов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ТипСклада</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыСкладов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cfe/Кодерлайн_интеграция_Розница/InformationRegisters/ксп_МэппингТипыСкладов/Ext/ManagerModule.bsl
// Описание_метода
//
// Параметры:
//	ТипСклада 	- строка - 
//
// Возвращаемое значение:
//	Тип: перечисление  ТипыСкладов
//
Функция ПоМэппингу(ТипСклада) Экспорт
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Рег.ТипСклада КАК ТипСклада
		|ИЗ
		|	РегистрСведений.ксп_МэппингТипыСкладов КАК Рег
		|ГДЕ
		|	Рег.Значение = &ТипСклада";
	
	Запрос.УстановитьПараметр("ТипСклада", ТипСклада);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.ТипСклада;
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции
